# Pandas reading and Writing
The main purpose of this notebook to get you to look at the pandas documenation  
[pandas Docs](https://pandas.pydata.org/pandas-docs/stable/index.html)  

#### Import the pandas
and set the sample data directory and filename

In [1]:
import pandas as pd

In [2]:
# just check the directory and file are there
!dir "../data"

 Volume in drive C is OS
 Volume Serial Number is FC43-C010

 Directory of C:\Users\ABeatty\OneDrive - Atlantic TU\PFDA-courseware\code\data

09/10/2025  12:59    <DIR>          .
08/10/2025  11:05    <DIR>          ..
01/10/2025  15:07            19,904 bankholidays.json
24/09/2025  14:35           279,315 cso-populationbyage.csv
24/09/2024  22:15             4,549 iris.csv
23/09/2024  18:52            24,802 iris.json
23/09/2024  19:20             9,141 iris.m
23/09/2024  19:19            20,485 iris.sql
01/10/2025  12:04                42 numbers.txt
09/10/2024  20:50            11,349 people-100-no-header.csv
09/10/2024  19:02            11,425 people-100.csv
24/09/2025  13:48             2,806 projectedbirths-cso.csv
01/10/2025  12:18                63 students.csv
              11 File(s)        383,881 bytes
               2 Dir(s)  25,450,651,648 bytes free

In [3]:
# up one levels to topic03 and then down into data
datadir = "../data/"
filename="people-100.csv"

#### Read in the csv file
<code>df = pd.read_csv(file)</code>

In [4]:
df= pd.read_csv(datadir+filename)

check what you got using 
<code>df.head()</code>
<code>df.info()</code>

In [5]:
df.head()

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Index          100 non-null    int64
 1   User Id        100 non-null    object
 2   First Name     100 non-null    object
 3   Last Name      100 non-null    object
 4   Sex            100 non-null    object
 5   Email          100 non-null    object
 6   Phone          100 non-null    object
 7   Date of birth  100 non-null    object
 8   Job Title      100 non-null    object
dtypes: int64(1), object(8)
memory usage: 7.2+ KB

### Reading in dates
mmmm! I would like the Date of birth to be a date object  
use
<code>pd.read_csv(file, parse_dates=[colnum])</code>

In [7]:
df = pd.read_csv(datadir+filename, parse_dates=['Date of birth'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Index          100 non-null    int64
 1   User Id        100 non-null    object
 2   First Name     100 non-null    object
 3   Last Name      100 non-null    object
 4   Sex            100 non-null    object
 5   Email          100 non-null    object
 6   Phone          100 non-null    object
 7   Date of birth  100 non-null    datetime64[ns]
 8   Job Title      100 non-null    object
dtypes: datetime64[ns](1), int64(1), object(7)
memory usage: 7.2+ KB

### While I am here 
if you want to limit what columes are read in 
<code>header=[list of cols]</code>

In [8]:
names_of_columns=['First Name', 'Last Name','Email','Phone', 'Date of birth']
df = pd.read_csv(datadir+filename,  usecols=names_of_columns,)
df.head(3)

,First Name,Last Name,Email,Phone,Date of birth
0,Shelby,Terrell,elijah57@example.net,001-084-906-7849x73518,1945-10-26
1,Phillip,Summers,bethany14@example.com,214.112.6044x4913,1910-03-24
2,Kristine,Travis,bthompson@example.com,277.609.7938,1992-07-02

### If there is not header row and you want to make names
use 
<code>header</code> <code> names</code>
use 
<code>index_col</code> to specifify the index Column

In [9]:
filename=filename="people-100-no-header.csv"

In [10]:
df= pd.read_csv(datadir+filename)
df.head(3)

,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
0,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
1,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
2,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher

In [11]:
df= pd.read_csv(datadir+filename, header=None, index_col=0)
df.head(3)

,1,2,3,4,5,6,7,8
0,,,,,,,,
1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath

In [12]:
names=['index','id','firstname','lastname','sex','email','phone','DOB','occupation']
df= pd.read_csv(datadir+filename, header=None,index_col=0,names=names, parse_dates=['DOB'])
df.head(3)
#df.info()

,id,firstname,lastname,sex,email,phone,DOB,occupation
index,,,,,,,,
1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath

### Reading from https or even S3 buckets
you can read files directly from the cloud into a Data Frame

In [13]:
df = pd.read_csv("https://drive.google.com/uc?id=1zO8ekHWx9U7mrbx_0Hoxxu6od7uxJqWw&export=download")
df.head(3)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/

Or even an S3 bucket
I had to <code>pip install s3fs</code> on my machine for this to work

In [14]:
# It can take a while to find a file you want
# this file contains weather info for phoenix in 2020
remote_file = "s3://noaa-gsod-pds/2020/72278023183.csv"

df = pd.read_csv( remote_file, storage_options={"anon": True})
df.head(3)

,STATION,DATE,LATITUDE,LONGITUDE,ELEVATION,NAME,TEMP,TEMP_ATTRIBUTES,DEWP,DEWP_ATTRIBUTES,...,MXSPD,GUST,MAX,MAX_ATTRIBUTES,MIN,MIN_ATTRIBUTES,PRCP,PRCP_ATTRIBUTES,SNDP,FRSHTT
0,72278023183,2020-01-01,33.4278,-112.00365,339.2,"PHOENIX AIRPORT, AZ US",50.4,24,32.8,24,...,11.1,999.9,60.1,,39.9,,0.0,G,999.9,0
1,72278023183,2020-01-02,33.4278,-112.00365,339.2,"PHOENIX AIRPORT, AZ US",51.0,24,36.4,24,...,9.9,999.9,64.0,,39.9,,0.0,G,999.9,0
2,72278023183,2020-01-03,33.4278,-112.00365,339.2,"PHOENIX AIRPORT, AZ US",52.0,24,31.9,24,...,8.0,999.9,64.0,,41.0,,0.0,G,999.9,0

## Writing data

if I do not know a data set I like to write it out to an Excel file so that I can inspect it

In [15]:
workbookFileName = 's3Data.xlsx'
df.to_excel(workbookFileName, sheet_name='phoenix', index=False)

More information on the PANDAS documenation
https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#io-excel-writer